
public class TestTestTest {

	public static void main(String[] args) {
//
////		[문항1]  [고객 관리 프로그램]
////				고객의 정보를 입력해서 관리하는 프로그램을 작성하세요.
////				고객의 정보는 이름, 성별, 이메일, 출생년도가 있습니다. 
//		고객의 정보를 입력 받아 고객 객체에 저장하고, 
//		고객 관리 프로그램은 고객의 정보를 리스트에 
//		저장, 조회, 수정, 삭제할 수 있는 기능이 있습니다. 
////				프로그램의 구동시 파일을 읽어 기존 정보를 얻은 채로 실행됩니다. 
//		마찬가지로 파일에 데이터를 저장할 수 있어야 합니다. 
//		(객체 직렬화 사용, CustomerManager.txt 파일에 저장)
////				이름으로 개인 정보 조회, 수정, 삭제가 가능해야 하고, 
//		이름으로 정보를 찾을 때 검색할 이름을 정확히 모를 경우에는 
//		다시 메뉴로 보내줄 수 있도록 해당 메서드를 종료할 수 있는 기능이 있어야 합니다.
////				또한 전체 데이터를 출력할 수 있는 기능이 있어야 합니다.
////				여러분들이 원하시면 입력 시 이름과 이메일 중복 체크해 
//		데이터를 검색하는 키인 이름에 중복이 들어가지 않게끔 걸러내는 기능도 추가해 주세요.
////				[요구사항]
////				⑴ 고객 정보는 이름, 성별, 이메일, 출생년도를 저장하고,
//		이 고객 저장을 위한 객체를 생성하세요.
////				⑵ 고객 정보의 자료는 이름은 문자열, 성별은 남(M), 여(F)로 저장, 
//		이메일은 문자열로 저장, 마지막으로 태어난 연도는 양의 정수로 입력받게 저장하세요.
////				⑶ 고객 객체는 리스트를 사용하여 저장합니다. (ArrayList<Customer> 형식)
////				⑷ 자바의 객체 직렬화를 이용하여 CusomerManager.txt 파일에 저장하세요.
////				⑸ 이름을 이용하여 개인 정보 조회, 수정, 삭제가 가능하게 만들어주세요
////				⑹ 다시 메뉴로 보내 줄 수 있게 종료 기능을 처리하세요.
////				⑺ 입력시 이름과 이메일 중복 체크 데이터를 검색하여 중복 저장되지 않게하는 기능을 추가합니다.
////
////				[제출파일]
//				답안지 파일: 코드를 export하여 제출하고, 하나의 클래스 파일에 코드를 기입하여 제출하세요.

	}

}
